---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsProjectConstructionTypeShadingfactorParam
source: html/87897295-44c5-3937-2040-d5b50977cba9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsProjectConstructionTypeShadingfactorParam Property

"Internal Shading Factor"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsProjectConstructionTypeShadingfactorParam { get; }
```